In [1]:
import pandas as pd

In [2]:
raw_data={
"city":["sydney","rome","washington","rome","tokiyo"],
"rank":["1st","2nd","3rd","1st","3rd"],
"score1":[23,44,55,89,90],
"score2":[78,90,89,78,67]    
}
df=pd.DataFrame(raw_data,
                index=pd.Index(['a','b','c','d','e'],name='letter'),
                columns=pd.Index(['city','rank','score1','score2'],name='attributes'))

In [3]:
df

attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67

In [4]:
df.iloc[3][2]#location based index

89

In [5]:
df.loc['c','score1']#label based index

55

In [6]:
df.at['e','city']#fast

'tokiyo'

In [7]:
df.iat[2,1] #fast

'3rd'

In [8]:
df['score1']['d']

89

In [9]:
df[:]

attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67

In [10]:
df[1:3]

attributes        city rank  score1  score2
letter
b                 rome  2nd      44      90
c           washington  3rd      55      89

In [11]:
df.sort_values(by=['city','score1'])

attributes        city rank  score1  score2
letter
b                 rome  2nd      44      90
d                 rome  1st      89      78
a               sydney  1st      23      78
e               tokiyo  3rd      90      67
c           washington  3rd      55      89

In [12]:
m=df

In [13]:
m.dropna

<bound method DataFrame.dropna of attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67>

In [14]:
m.dropna(how='all',axis=1)

attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67

In [15]:
m

attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67

In [16]:
m.fillna(1)

attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67

In [17]:
m.fillna(1,inplace=True)

In [18]:
m

attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67

In [19]:
#sorting
rawdata={
"city":["sydney","rome","washington","rome","tokiyo"],
"rank":["1st","2nd","3rd","1st","3rd"],
"score1":[23,44,55,89,90],
"score2":[78,90,89,78,67]    
}
df=pd.DataFrame(raw_data,
                index=pd.Index(['a','b','c','d','e'],name='letter'),
                columns=pd.Index(['city','rank','score1','score2'],name='attributes'))

In [20]:
df

attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67

In [21]:
df.sort_values

<bound method DataFrame.sort_values of attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67>

In [22]:
df.sort_values(by=['city','rank'])

attributes        city rank  score1  score2
letter
d                 rome  1st      89      78
b                 rome  2nd      44      90
a               sydney  1st      23      78
e               tokiyo  3rd      90      67
c           washington  3rd      55      89

In [23]:
df.sort_values(by='city',ascending=False)

attributes        city rank  score1  score2
letter
c           washington  3rd      55      89
e               tokiyo  3rd      90      67
a               sydney  1st      23      78
b                 rome  2nd      44      90
d                 rome  1st      89      78

In [24]:
df.sort_values(by=['city','score1'])

attributes        city rank  score1  score2
letter
b                 rome  2nd      44      90
d                 rome  1st      89      78
a               sydney  1st      23      78
e               tokiyo  3rd      90      67
c           washington  3rd      55      89

In [25]:
#hierarchial Indexing
rawdata={
"city":["sydney","rome","washington","rome","tokiyo"],
"rank":["1st","2nd","3rd","1st","3rd"],
"score1":[23,44,55,89,90],
"score2":[78,90,89,78,67]    
}
df=pd.DataFrame(raw_data,
                index=pd.Index(['a','b','c','d','e'],name='letter'),
                columns=pd.Index(['city','rank','score1','score2'],name='attributes'))
df

attributes        city rank  score1  score2
letter
a               sydney  1st      23      78
b                 rome  2nd      44      90
c           washington  3rd      55      89
d                 rome  1st      89      78
e               tokiyo  3rd      90      67

In [26]:
df.set_index(['city','score2'],drop=False)

attributes               city rank  score1  score2
city       score2
sydney     78          sydney  1st      23      78
rome       90            rome  2nd      44      90
washington 89      washington  3rd      55      89
rome       78            rome  1st      89      78
tokiyo     67          tokiyo  3rd      90      67

In [27]:
df.set_index(['city','score2'],drop=False,inplace=True)

In [28]:
df

attributes               city rank  score1  score2
city       score2
sydney     78          sydney  1st      23      78
rome       90            rome  2nd      44      90
washington 89      washington  3rd      55      89
rome       78            rome  1st      89      78
tokiyo     67          tokiyo  3rd      90      67

In [29]:
df.index

MultiIndex([(    'sydney', 78),
            (      'rome', 90),
            ('washington', 89),
            (      'rome', 78),
            (    'tokiyo', 67)],
           names=['city', 'score2'])